[
    {
        "q": "What should I expect for class?",
        "a": "All classes are different in content, but the structure is similar. We start off with a warm up (10-15 mins), most likely jump rope followed by calisthenics."
    },
    {
        "q": "How should I prepare for class?",
        "a": "Call and set up your trial appointment. Once set, come early and be ready to work."
    },
    {
        "q": "What do I need to bring to class?",
        "a": "During class, students will need hand wraps, gloves, and shin guards. It is recommended that you bring water and a towel, as well. First timers, gear will be provided for you."
    },
    {
        "q": "Do you supply equipment?",
        "a": "Members can use our equipment for free during the first week. This provides the student time to find a favorite brand and purchase your own gear. If you forget something, you will forgo the drill(s)"
    },
    {
        "q": "What time should I get to the gym?",
        "a": "Please arrive no earlier than 15 minutes prior to the start time. This additional time allows for a quick tour, assistance with hand wrapping, and help with equipment fitting."
    },
    {
        "q": "What should I wear?",
        "a": "Muay Thai shorts, these shorts are short to allow for maximum range of motion. Any comfortable workout shirt is acceptable. We do not wear shoes in class nor on the mats so slip on shoes are ideal for optimal traveling when needed to be off the mats."
    },
    {
        "q": "What if I have never done muay Thai or any type of martial art?",
        "a": "We like to say that we all started at the beginning! We accommodate all skill levels here and welcome the opportunity to teach our style to novices."
    },
    {
        "q": "I don't want to get hit. Is this a contact workout?",
        "a": "First, TempleMT has rules pertaining to contact and the Coaches oversee the adherence to those rules. For the Beginner's Class, in particular, most drills are taught with contact made either to Thai pads or your partner's gloves. There is contact in the context of some drills but keep in mind that students wear protective training gear. If your partner's technique is too strong, we encourage communication and guidance between all students."
    },
    {
        "q": "I've never hit anything before. Will I hurt myself?",
        "a": "Again, we promote proper technique and injuries should be minimal when employing what is taught."
    },
    {
        "q": "Do I need to be in great shape to do the classes?",
        "a": "Learning Muay Thai is a committed practice that takes time and dedication. During the Beginner's Classes we encourage our students to slow down and work on technique. You will get a great workout, but we want our students to learn the art and fundamentals well."
    },
    {
        "q": "I have muay Thai experience, Can I jump in the advanced class?",
        "a": "We require that everyone starts in the Beginner's Class so that our Coaches can assess your skill level and provide appropriate placement in order to challenge your practice and continue developing your skills."
    },
    {
        "q": "What is your class capacity?",
        "a": "Typically, our maximum capacity is about 20 students. Our morning classes are typically smaller with 6-10 students, whereas the night classes are around 12-18 students."
    },
    {
        "q": "What can I expect the following day(s)?",
        "a": "As with any exercise regimen, students should expect to be sore in accordance with their baseline physical ability. What might be unexpected, and different from non-contact exercises, is some light bruising. Bruises are typically observed on the shins and forearms and are caused by holding pads. The bruising is minimally painful, if at all."
    },
    {
        "q": "What if I have an injury or medical condition?",
        "a": "Always consult a medical professional for their opinion about any pre-existing injuries. We encourage any potential students to stop by a Beginner's Class if you wish to have a better idea of the expectation and whether Muay Thai is a viable exercise option for you. If you decide to give us a try, be sure to let a Coach know about any limitations and they will accommodate your injury and ensure proper technique to minimize future risk of injury. Learning Muay Thai is a practice - <em>your</em> practice - so take breaks when needed."
    },
    {
        "q": "How often should I come?",
        "a": "As with any new skill, more practice should mean that you will advance quickly. So we recommend 2-3 days a week, minimum. However, it's important to listen to your body and know your limits. If you have an injury, consult your physician before returning to full activity level."
    },
    {
        "q": "Will I lose weight?",
        "a": "Exercise is only one part of the journey towards better health. This practice will push your body and your limits. Students have lost up to 80 lbs, but individual results vary."
    },
    {
        "q": "I'm going to buy equipment. What brands do you recommend?",
        "a": "Our preferences include:<ul><li>Twins</li><li>Top King</li><li>Fairtex</li><ul>We also stock our own gloves, wraps, and shin guards provided by Combat Corner."
    },
    {
        "q": "How much is the TempleMT merchandise?",
        "a": "<ul><li>Shirts - $20</li><li>Tank Tops - $25</li><li>Shorts - $45</li><li>Shin Guards - $35</li><li>Gloves - $35</li><li>Hand wraps - $8</li></ul>"
    }
]